{

   "channelName": "Mathematics SE",
   "channelContext": "This channel is used for mathematics questions from https://math.stackexchange.com/",
   "channelWikiTopics": ["General", "Real-Analysis", "Calculus", "Linear Algebra", "Integration"],
   "channelThreads": [
        {
            "threadMessage":"For example, can I write \"10,\" if I want to write the number 10 with two significant figures. I know it can be done in some countries using a decimal point, but where I'm from, the decimal comma is used instead of the decimal point.",
            "threadReplies": [
                "As long as you clearly explain what your notations mean , you can use them. Whether this a standard way is another story. That must be answered by someone else.",
                "These ambiguities can also be resolved using scientific notation; the number 10 to one significant figure (s.f.) is 1×101 , to 2 s.f. it's 1.0×101, and so forth."
            ]
        },
        {
            "threadMessage":"Let the set of three points be M= (a,b,c)             Form a neighbourhood Oa, Ob and Oc             around the points a, b, c. Say the neighbourhoods around a and b are open, but for c it is closed.            What are then the following neighbourhoods: {a,c} ? {a,b}? , {b,c} ? {a,b,c}? Open or closed? So my attempt is Oa=open,Oca=closed,Ob=open,Ocb=closed,Oc=closed,Occ=open. Then the equivalent neighbourhoods around {a,b} must be open, but what about the neighbourhoods around {a,c},{b,c},{a,b,c}? Can they be open and closed at the same time? Thanks",
            "threadReplies": [
                "What a preposterous behavior of some here who just gave thumb down without any explanation. Shame on you. You are lazy and contribute with nothing to this forum.",
                "I don't understand the question. What do you mean by a=open? That is a completely nonsensical statement. Are you saying that the set {a} is open? If so, how do you know that? I am voting to close this question for lack of clarity and am also downvoting it for the same reason.",
                "\"open\" and \"closed\" require a topology on a given set, in order to make sense.",
                "If we were to interpret what you wrote (let it be open for a and b) to mean that you are using the topology τ where τ is the smallest topology containing {a} and {b} while not containing {c}, then we know from the definition of a topology that it contains unions of elements in it as well as the emptyset and universal set... i.e. that τ={∅,{a},{b},{a,b},M}... i.e. these are the open sets in our topology. Complements of these sets are called closed. I.e. {∅,{b,c},{a,c},{c},M} are closed.",
                "So, it is wrong to call a open... it is {a} which is open. Do not confuse the object a with the object {a} as these are very different things. Yes, {a,b} is open, and yes {a,c} is closed and so on... Yes {a,b,c} is both open and closed simultaneously (as both ∅ and the parent set are always both open and closed in any topology). Yes there exist sets which are both open and closed, and yes there exist sets which are neither open nor closed in certain topologies. "
            ]
        },
        {
            "threadMessage":"Limit of a function with three variables. f(x,y,z)=(x+y+z−3)^3/((z3)(x−1)(y−2))           I want the limit for this function as (x,y,z) approaches (1,2,0). How do I evaluate this limit?",
            "threadReplies": [
                "Use This guide https://math.meta.stackexchange.com/questions/5020/mathjax-basic-tutorial-and-quick-reference perhaps",
                "If you pretend to edit your posting, by taking the edit link, you will have access to the MathJax syntax used by Robert Z to present the math in your posting.",
                "Your posting is missing several details. Please see this article on MathSE protocol. https://math.meta.stackexchange.com/questions/33190/how-to-avoid-downvotes-for-beginners-questions/33236#33236"
            ]
        },
        {
            "threadMessage":"Can an algorithm prove that it produced its own output? Apologies in advance for my ignorance. I am working on a research question in a different area, and it would be helpful to know the answer to the following question, or even a reference to any such results or discussion (I don't even know what terms to look for). Imagine that you have a well-defined algorithm that takes some input data, does some operations and perhaps generates or uses some random numbers/coin flips, and then based on these steps produces an output. Suppose an outside observer is told that this algorithm ran to produce some output. The outside observer sees the output, but does not see the input (or all of the input). Is there a way to structure the algorithm in a way that allows the outside observer to CHECK or VERIFY that the output came from the algorithm and was not tampered with by a malicious actor?  I am sure this is a question that has been studied before, I just don't know what to look for when searching for the answer. Any guidance would be much appreciated!",
            "threadReplies": [
                "Just to clarify , the observer knows the output and the (randomized) algorithm and shall conclude the input ? This won't usually work since most machines will produce identical outputs with many different inputs.",
                "Sounds like a question for https://crypto.stackexchange.com/",
                "If we have a machine which produces a different output for every input , then of course , we can , in principle , recover this input.",
                "In this Case , there is no way to confirm or verify , in most general terms. It is generally valid to assume that the algorithm has multiple outputs , which vary with the inputs. Then Malicious Actor (MA) can given Input I1, collect the output O1.  When OB wants the Input to say I2 ( which OB is not even aware of ) , then MA can give O1, not O2, which OB will never figure out. At most , we can try to be sure that the Output was generated by the algorithm , by making the algorithm insert some Cryptographic CodeWord , which can be extracted by some Computations , while being hard to insert. In the Case , MA can not make up fictitious Output O3, because the Cryptographic CodeWord Extraction will fail."
            ]
        },
        {
            "threadMessage":"Define two events such that they exhibit conditional independence with B but not with B complement. Are there any examples of events A and B such that P(A∩B|C)=P(A|C)P(B|C) but not with C'? Especially with dice or coins? or is there any specific example? ",
            "threadReplies": [
                "No idea what you are asking.",
                "compliment → complement",
                "Please clarify your specific problem or provide additional details to highlight exactly what you need. As it's currently written, it's hard to tell exactly what you're asking.",
                "@CrSb0001 An example of events exhibiting conditional independence with event C but not with its complement ie C'",
                "There is an urn with two balls, black and white. You also have a fair coin. You flip the coin, and then... If the result is heads, you draw two balls from the urn with replacement. If the result is tails, you draw two balls form the urn without replacement. Let C be the event the coin is heads, let A be the event the first ball you draw is white, and let B be the event that the second balls is black. Clearly, A and B are conditionally independent given C, but A and B are conditionally dependent given C¯¯¯¯ ."
            ]
        },
        {
            "threadMessage":"shifted function and differential let f is q times continuously differentiable in [a, b] then( For positive integer n with a≤n≤b )f(n−1+x)is q times continuously differentiable in [0, 1].",
            "threadReplies": [
                "Welcome to Mathematics SE. Take a tour. You'll find that simple \"Here's the statement of my question, solve it for me\" posts will be poorly received. What is better is for you to add context (with an edit): What you understand about the problem, what you've tried so far, etc.; something both to show you are part of the learning experience and to help us guide you to the appropriate help. You can consult this link for further guidance."
            ]
        },
        {
            "threadMessage":"Generating a random prime How can I generate a random prime of the form 2ab+1 for small b value without actually creating a list of such primes, and then choose from the list at random? For example: I can generate a random n bit prime by choosing a random n bit integer c from [2n,2n+1], and then pick the next prime (or the previous prime) after c. Does there exist such strategy for primes of the form 2ab+1? Any idea or suggestion will be greatly appreciated",
            "threadReplies": [
                "Take a look at this Are there infinitely many primes of the form k⋅2n+1? https://math.stackexchange.com/questions/79419/are-there-infinitely-many-primes-of-the-form-k-cdot-2n-1",
                "There is nothing better than to create random candidates without a small factor until you have a prime.",
                "And what does \"random\" mean? Which ranges are allowed for a and b?",
                "At least such primes (called Proth primes\" , if 2^a > b and b odd) can be efficiently proven to be prime.",
                "I cannot see a restriction of k in the linked question. And without such a restriction , EVERY odd prime can be written this way. Here, b is demanded to be \"small\""
            ]
        },
        {
            "threadMessage":"Is there an easier way to prove the Fundamental Theorem of Algebra for polynomials with real coefficients? My current level of maths does not allow me to understand any of the proofs I was able to find online for the Fundamental Theorem of Algebra. I find it very unsettling having to continue learning about polynomials without being able to grasp such a fundamental property of them that is there exists a complex root for any polynomial with complex coefficients. My question is, is there a way I can reach the same conclusion of the Fundamental Theorem of Algebra for polynomials with real coefficients instead of complex coefficients. In other words, to prove that at least one complex root exists for a polynomial with real coefficients. Does restricting the coefficients to be real instead of complex make things any easier? If the answer to my question above is no, then I would appreciate it if you could provide any sources that I could've missed, that explain the Theorem by using the least amount of mathematical notation and advanced concepts as possible. If I cannot figure this out, I am going to have to accept the existence of a root as an axiom going further, which is something I really don't want to do.",
            "threadReplies": [
                "To know the sources you might've missed we'd have to know where you already looked.",
                "I can't imagine that it is possible to prove FTA with less machinery than this ime.usp.br/~oliveira/FTAAUTHOR.pdf Personally I don't think restriction to the real case is going to help.",
                "I think it’s worth challenging the general premise – not that it necessarily applies to the OP’s case, but to point out its limits. “I’m temporarily accepting a theorem as valid because the proof is too advanced for my current self or uses concepts I’m currently unfamiliar with” is not bad. At a high level, it even becomes necessary, because in a lot of math, problem statements are simpler and shorter than the answers. ",
                "Check this: math.stackexchange.com/q/3195875/42969",
                "@WillJagy I think that there are fields over which every odd-degree polynomial has a root but there are irreducible polynomials of arbitrarily large even degree. So - unless my memory is wrong - the jump to even degree is truly subtle."
            ]
        },
        {
            "threadMessage":"Is \"William only eats icecream when the sun is shining\" a biimplication? William only eats icecream when the sun is shining Let P(t) be the sun is shining at time t.            Let Q(t) be William is eating an icecream at time t.            Which implication is there between P(t) and Q(t)?            My friend has suggested that it is a biimplication, but I disagree, since it would then mean that every time the sun is shining William would be eating an icecream.  I have suggested that it is instead Q(t)→P(t), since we know that if William is eating icecream then the sun will be shining.",
            "threadReplies": [
                "The mathematician RL Moore took the position that “only if” should mean “if and only if”. The idea is that “A only if B” is a stronger statement than “A if B”. Not only are we told that “A if B”, but we are given a little extra information: “A only if B”. So if someone thinks your example is a biimplication, they’re not crazy. However, mathematicians have adopted the convention that “A only if B” means “A implies B”.",
                "Something's off with the question. It needs to be corrected.",
                "Pedantically, I have to point out that different positioning of \"only\" within the sentence can make the sentence mean different things. IMHO, in the position \"only\" occupies in this sentence (\"William only eats ice cream\"), it attaches to the verb \"eats\" and excludes any other actions William might perform on the ice cream. William only eats ice cream; he doesn't throw it.",
                "@HenryWoody I believe the rigorous way to write the statement is \"William eats ice cream only if the sun is shining\" and then it becomes an obvious instance of the \"only if\" construct.",
                "@IlmariKaronen I agree with littleO that \"A only if B\" should be equivalent to \"A implies B\". Surely \"A if and only if B\" should be equivalent to the conjunction \"(A if B) and (A only if B)\". The first of these, \"A, if B\", may be rewritten as \"if B, then A\", so that one is certainly \"B implies A\". The other one, then, must be \"A implies B\". Thus \"A only if B\" is equivalent to \"A implies B\""
            ]
        },
        {
            "threadMessage":"How do I know what assumptions I can make in a proof? I'm given this proof and am told to prove by deduction: (p∨(q∧r))→(((q∧r)→p)→p) I have the following rules that I can use: ∧ introductions and eliminations ∨ introductions ∨ eliminations (a case analysis where I prove each case)  → introductions Modus Ponens Modus Tollens My issue is that I do not know what I can assume as true/where to begin assuming which parts of the proof are true.  How do I know what assumptions I can make in a given proof? Is there a procedural way to determine what is safe to assume?",
            "threadReplies": [
                "Here's a MathJax tutorial :) https://math.meta.stackexchange.com/questions/5020/mathjax-basic-tutorial-and-quick-reference",
                "Try this https://math.stackexchange.com/questions/4645435/how-where-is-this-technique-generalised-and-proven-for-other-standard-first-or",
                "You could use this as a guide. https://math.stackexchange.com/questions/4766899/how-do-i-know-what-assumptions-i-can-make-in-a-proof",
                "Thank you @Shaun! The second link was very helpful!",
                "Work backwards from the result you want. You want to prove something of the form A→B, so your last step could be a → introduction. This means you'll have a sub-proof that assumes A and proves B."
            ]
        },
        {
            "threadMessage":"Counterexample in topos theory Motivation: The definition of an elementary topos requires both a subobject clasiffier and either power objects or exponentiation. But also, if a category has power objects and a terminal object 1 then (according to Kock and Mikkelsen) it has a subobject classifier and it is P1. Question: Is the opposite true? Does a subobject classifier imply the existence of power objects? I wouldn't know how to start such a proof. The Ω -axiom of the subobject classifier doesn't seem strong enough to enable a construction of some object Px and morphism ∈x:x×Px→Ω such that... (here I would use the definition of power objects by Goldblatt. Kock and Mikkelsen use an alternative one, also explored by Goldblatt, which doesn't use a subobject classifier) I can't find much online or in the reference books Thanks in advance!",
            "threadReplies": [
                "A simple counterexample is the category of countable sets. This has a subobject classifier (the usual 2-element set) but a countably infinite set does not have a power object since its power object would have to have uncountably many points (since it has uncountably many subobjects)."
            ]
        },
        {
            "threadMessage":"In mathematics field which book best for counter examples of group theory, linear algebra?",
            "threadReplies": [
                "I can't say we have a preexisting post that covers this... so this one may well stand! I'm personally not sure I've seen such a book for these particular fields.",
                "What would that look like? Would it state every logical proposition about groups that isn't true and give a counter-example?",
                "In \"Gelbaum B.R., Olmsted, J.M.H.: Theorems and Counterexamples in Mathematics, Springer (1990)\" the first chapter is about \"group theory\" and \"linear algebra\".",
                "@JohnDouma There's precedent for such books, e.g. Steen and Seebach's Counterexamples in topology and Hutchins' Examples of commutative rings. Usually they just contain context about what the terms mean, constructions, proofs about what the constructions do, but little or no exposition about the theory in general.",
                "@Gerd Please consider formulating your comment as a solution.",
                "@rschwieb I will do that if the question reopens.",
                "@Gerd It's reopened.",
                "It does not cover linear algebra but, for group theory, the book Examples of Groups by Michael Weinstein is a gem. It's an older book, but there appear to be used copies available online."
            ]
        },
        {
            "threadMessage":"Has every infinite simple group a faithful irreducible representation? Has every infinite simple group a faithful irreducible representation? This question solves the finite case. However, the proof requires a non-trivial linear representation of a finite group. I want to know if the conclusion is true for an infinite simple group. If it is not, can you give me a counterexample?",
            "threadReplies": [
                "You should specify if the representation is finite-dimensional or not.",
                "Off topic: saw this question on the Hot Network Questions, I never would have guessed this was a math question just by reading the title, lol (not a mathematician)",
                "I have only learned finite dimension representation of groups, and the question was under the finite dimension representation condition when I asked. But it is nice to see a more general result.",
                "The statement is true for infinite groups with some exceptions if you allow infinite-dimensional representations Unless G is a p-group, where p is the characteristic of k, the group ring k[G] is not local, so there exist at least two isomorphism classes of simple modules, in particular, there is an irreducible representation where G acts nontrivially. Such a representation is faithful, because G is simple and so any nontrivial homomorphism from G is injective. Conversely, if G is p -group (such as a Tarski monster), where p is the characteristic of k, then k[G] is local and hence there is only one irreducible representation, the trivial one, which is not faithful."
            ]
        },
        {
            "threadMessage":"I'm studying real analysis out of Pugh's book. Consider this theorem: Theorem: Let f be a continuous function defined on [a,b]. Then f has an absolute maximum and minimum. This seems obvious, but it isn't as easy to prove as our intuition suggests (I have Pugh's proof in mind). This is typical in real analysis. Furthermore, the proof that Pugh gives doesn't explain why the theorem is intuitively obvious to us. Question: Is there a \"pathological\" continuous function that illustrates why this theorem isn't as easy to prove as our intuition suggests? That is to say, is there an example that can make us doubt our intuition regarding this particular theorem?",
            "threadReplies": [
                "@Xander, the epsilontic arguments for this do seem convoluted",
                "I don't quite see the point of this question, one attempt one can try to analyze this is to write the proof of this and then, see which steps are potentially problematic. So far it just seems to attract lots of attention of people that just \"say words\"",
                "If it seems obvious to you, try to come up with a pseudo proof based on yout intuition. Just put it on paper, without worries about being formal. Then you analyze where your intuitive proof \"breaks\".",
                "I'm perfectly happy with the proof, and it doesn't cause me any discomfort. I'm quite used to seeing (and producing) proofs like this. My question was, why isn't it as easy to prove this theorem as it is to intuit that it is true?",
                "@semisimpleton Many things in in math are \"intuitively obvious\", but translating that intuition into a proof can be hard. Sometimes, our intuition is simply wrong, other times our intuition doesn't account for the full generality of an idea, etc. "
            ]
        },
        {
            "threadMessage":"Vector space of functions on an empty domain? I know that these sorts of pathological cases are irrelevant, but I want to \"practice\" as it were and so want to understand the following. Hoffman and Kunze give the following example of a vector space: The space of functions from a set to a field. Let F be any field and let S be any non-empty set. Let V be the set of all functions from the set S into F. They give the usual definitions of addition and scalar multiplication. At any rate, my question is about why they give the nonempty requirement. If S is empty, then V itself is not empty but rather contains the empty set (the empty set can be defined as a function on an empty set), V={∅}. If I define ∅ as my neutral element, then why on earth can't this be a vector space?",
            "threadReplies": [
                "I see @badjohn So, is it fair to say that we could define a vector space as I have above, but we choose not to?",
                "It is a vector space. It's just that some people don't like functions with empty domains. The example does not exclude this case, nor does it say that if you take S=∅ then it is not a vector space.",
                "@ArturoMagidin I was just being cautious. \"At least some\" includes the case \"all\".",
                "Sorry, it was over-cautious. Now, with your answer, it serves no purpose and I will delete it.",
                "It is a vector space (a zero dimensional/trivial vector space). There are some people who don't like functions with empty domains (they introduce a few issues; e.g., it is not true that \"a function is injective if and only if it has a left inverse\" if you allow functions with empty domain). Or who find them somewhat confusing. So they don't want to deal with them. I suspect that is what is at issue here. The author does not want to consider functions with empty domain, so they exclude S=∅. The wording of the example does not categorically state that you will not get a vector space when S is empty: it just does not treat that case and is silent about it."
            ]
        },
        {
            "threadMessage":"What are the classic or great books for Algebra, Geometry, and Trigonometry that are similar to what Spivak, Courant, and Apostol are for Calculus? What are the classic or great books for Algebra, Geometry, and Trigonometry that are similar to what Spivak, Courant, and Apostol are for Calculus?",
            "threadReplies": [
                "For geometry, Introduction to Geometry by Coxeter fits the bill, I think.",
                "What do you mean by elementary algebra? Do you mean solving for X in equations like 2X+5=9? Do you mean introductory linear algebra textbooks?",
                "The former. By elementary algebra I mean what would be taught in high school algebra or college algebra, but not watered down. Things like polynomials, intermediate value theorem, inequalities, absolute value, cramers rules, matrix algebra, division algorithm, etc with lots of their properties and problems that aren't completely trivial. Maybe similar to the algebra in the math olympiad. Not linear algebra though.",
                "Gelfand's books",
                "Look at these algebra books https://www.nctm.org/classroomresources/?messageID=6887855 and these trig books https://math.stackexchange.com/questions/838514/good-book-on-advanced-trigand these geometry books https://math.stackexchange.com/questions/1402566/high-school-geometry-text",
                "I think what you mean is algebra, trig, and geometry books with rigor as the calc text you mentioned. I know some, for algebra and trig I recommend Modern Algebra and Trigonometry by Vance. This book provides the elementary concepts of algebra and trig but with rigor and full proofs on all the theorems. He even added concepts from abstract algebra and analysis such as field, order, completness. The problem is hard. You are asked to prove a lot of things and don’t worry, he explain the necessary methods of proof. He even introduced limits.                For geometry, it is Geometry by Moise and Downs. It is a good book with proofs that includes analytic geometry. Nothing much to say because geometry isn’t my priority."
            ]
        },
        {
            "threadMessage":"Smoothness of heat kernel on Lipschitz and polygon (cornered) domain I'm wondering the spatial smoothness of the heat kernel K(t,x,x0) on Lipschitz and polygon domain (or cornered domain). It's well known that K(t,x,x0) is smooth in t for very general domains. How about the spatial regularity? There are some results for the Laplace kernel on cornered domain using microlocal analysis (b-calculus), but I didn't find the results for heat kernel.",
            "threadReplies": [
                "You can definitely find some papers on coefficients of the trace of the heat kernel in this setting (e.g. https://arxiv.org/abs/0901.0019), but this might not be what you want. Otherwise, I am not sure if there is a computation of the heat kernel performed in such generality, but I recall hearing that polygons fit within the framework of stratified spaces of depth 2, so they might be studied using an iterated version of edge calculus, a generalisation of b-calculus that follows the same philosophy, fitting into Melrose's (and others) program of Lie algebroids and groupoids. This framework provides a road map with which to compute a heat kernel, but it could be that this specific case has some particularities that make it more difficult."
            ]
        },
        {
            "threadMessage":"Number of triangles a point lies in on a plane. On a plane, there are 2n+1 points where no three points are co-linear. Show that for any point P which is one of the points, the number of triangles the interior of which P lies in is always even. My attempt : an easy observation is that for any fours points, the number of triangles P lies in is either 0 or 2 & Conclusion holds for n=2. But I am not sure this is sufficient to give the argument for all n in general.",
            "threadReplies": [
                "is P one of the 2n+1 points?",
                "Are we assuming no three points are collinear?",
                "I have edited the question to make it clear. Thanks for pointing them out!",
                "There's a similar rule if the total number of points is even rather than odd. If you determine that, you can proceed by induction.",
                "It's an interesting question. However, I have downvoted due to lack of effort in trying to answer the question."
            ]
        },
        {
            "threadMessage":"Calculate the area of a triangle. I might be reading between the lines but I'm trying to calculate a vector triangle without using cross product. The question goes:            Calculate the area of the triangle whose vertices are at points (1, 3, 1), (2, -1, 0) and (0, 4, 2). Any idea how to think regarding this question?",
            "threadReplies": [
                "Welcome to Math SE. There are multiple methods available to calculate the area of a triangle. However, if you specifically don't want to use the cross-product, one way is to determine the triangle side lengths and then use Heron's formula",
                "Please clarify your specific problem or provide additional details to highlight exactly what you need. As it's currently written, it's hard to tell exactly what you're asking.",
                "See Heron's Formula https://en.wikipedia.org/wiki/Heron%27s_formula",
                "Cayley-Menger determinant https://en.wikipedia.org/wiki/Cayley%E2%80%93Menger_determinant"
            ]
        },
        {
            "threadMessage":"Missing the balloons on an infinite grid. You are standing at the center of an infinite 2D grid, where there is a circle of radius r at every grid point. Your goal is to draw a straight line through the origin that does not intersect any of the circles (excepting the one at the origin). For a small but finite r does such a line exist? If it's possible, what is the largest r for this to be true? I feel it makes intuitive sense that such a line exists, but I'm struggling to prove it.",
            "threadReplies": [
                "Since the line goes through the origin and it isn't horizontal or vertical, it can be expressed in the form y=mx, where m≠0. Consider the cases where m is rational and irrational, using results such as in Density of positive multiples of an irrational number for the latter case.",
                "If the line's gradient m is rational, say pq, it passes through the gridpoint (q,p). If not, we can approximate m arbitrarily well with rationals (eg just take more digits of its decimal expansion), so no such r exists."
            ]
        }
    ]
}
